In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
county_tax_receipts = pd.read_csv('../data/countytaxreceipts.csv')
county_tax_receipts

,Year,County,County Tax Receipts (Local Tax In Millions),LastReportedDate,Unnamed: 4
0,2001,Anderson,1.4328,2021-02-04,NaN
1,2001,Bedford,0.7659,2021-02-04,NaN
2,2001,Benton,1.5913,2021-02-04,NaN
3,2001,Bledsoe,0.4216,2021-02-04,NaN
4,2001,Blount,5.9471,2021-02-04,NaN
...,...,...,...,...,...
1809,2019,Weakley,0.7429,2021-02-04,NaN
1810,2019,White,1.1062,2021-02-04,NaN
1811,2019,Williamson,10.0336,2021-02-04,NaN
1812,2019,Wilson,5.2766,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [3]:
#rename County Tax Receipts column
county_tax_receipts = county_tax_receipts.rename(columns={"County Tax Receipts (Local Tax In Millions)": "county_tax_receipts_in_millions"})
county_tax_receipts

,Year,County,county_tax_receipts_in_millions,LastReportedDate,Unnamed: 4
0,2001,Anderson,1.4328,2021-02-04,NaN
1,2001,Bedford,0.7659,2021-02-04,NaN
2,2001,Benton,1.5913,2021-02-04,NaN
3,2001,Bledsoe,0.4216,2021-02-04,NaN
4,2001,Blount,5.9471,2021-02-04,NaN
...,...,...,...,...,...
1809,2019,Weakley,0.7429,2021-02-04,NaN
1810,2019,White,1.1062,2021-02-04,NaN
1811,2019,Williamson,10.0336,2021-02-04,NaN
1812,2019,Wilson,5.2766,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [4]:
#sort county_tax_receipts in descending order
sorted_county_tax = county_tax_receipts.sort_values(by='county_tax_receipts_in_millions', ascending = False)
sorted_county_tax

,Year,County,county_tax_receipts_in_millions,LastReportedDate,Unnamed: 4
1739,2019,Domestic&international,661.5089,2021-02-04,NaN
1643,2018,Domestic&international,630.9263,2021-02-04,NaN
1547,2017,Domestic&international,604.9464,2021-02-04,NaN
1451,2016,Domestic&international,580.0624,2021-02-04,NaN
1355,2015,Domestic&international,551.9964,2021-02-04,NaN
...,...,...,...,...,...
348,2004,Moore,0.0561,2021-02-04,NaN
253,2003,Moore,0.0554,2021-02-04,NaN
158,2002,Moore,0.0553,2021-02-04,NaN
63,2001,Moore,0.0528,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [26]:
#remove Domestic&international rows
sorted_county_tax_2 = sorted_county_tax[sorted_county_tax["County"].str.contains("Domestic&international")==False]
sorted_county_tax_2

,Year,County,county_tax_receipts_in_millions,LastReportedDate,Unnamed: 4
1735,2019,Davidson,189.0129,2021-02-04,NaN
1639,2018,Davidson,175.6896,2021-02-04,NaN
1543,2017,Davidson,166.6413,2021-02-04,NaN
1447,2016,Davidson,156.4054,2021-02-04,NaN
1351,2015,Davidson,147.4472,2021-02-04,NaN
...,...,...,...,...,...
443,2005,Moore,0.0599,2021-02-04,NaN
348,2004,Moore,0.0561,2021-02-04,NaN
253,2003,Moore,0.0554,2021-02-04,NaN
158,2002,Moore,0.0553,2021-02-04,NaN
63,2001,Moore,0.0528,2021-02-04,NaN

In [33]:
#only keep years: 2001, 2010, 2019
sorted_county_tax_3 = sorted_county_tax_2[sorted_county_tax_2["Year"].isin(["2001", "2010", "2019"])]
sorted_county_tax_3

,Year,County,county_tax_receipts_in_millions,LastReportedDate,Unnamed: 4
1735,2019,Davidson,189.0129,2021-02-04,NaN
1796,2019,Shelby,105.1161,2021-02-04,NaN
873,2010,Davidson,98.6645,2021-02-04,NaN
933,2010,Shelby,82.5979,2021-02-04,NaN
18,2001,Davidson,75.8529,2021-02-04,NaN
...,...,...,...,...,...
1802,2019,Trousdale,0.1428,2021-02-04,NaN
939,2010,Trousdale,0.1183,2021-02-04,NaN
84,2001,Trousdale,0.0804,2021-02-04,NaN
918,2010,Moore,0.0782,2021-02-04,NaN
63,2001,Moore,0.0528,2021-02-04,NaN

In [39]:
pd.DataFrame(data = sorted_county_tax_3)

,Year,County,county_tax_receipts_in_millions,LastReportedDate,Unnamed: 4
1735,2019,Davidson,189.0129,2021-02-04,NaN
1796,2019,Shelby,105.1161,2021-02-04,NaN
873,2010,Davidson,98.6645,2021-02-04,NaN
933,2010,Shelby,82.5979,2021-02-04,NaN
18,2001,Davidson,75.8529,2021-02-04,NaN
...,...,...,...,...,...
1802,2019,Trousdale,0.1428,2021-02-04,NaN
939,2010,Trousdale,0.1183,2021-02-04,NaN
84,2001,Trousdale,0.0804,2021-02-04,NaN
918,2010,Moore,0.0782,2021-02-04,NaN
63,2001,Moore,0.0528,2021-02-04,NaN

In [52]:
#sorted_county_tax_3.groupby('County')
sorted_county_tax_3 = sorted_county_tax_3.groupby(['County',  'Year'])
sorted_county_tax_3

In [5]:
employment = pd.read_csv('../data/employementinthousands.csv')
employment

      Year      County  Employement In Thousands LastReportedDate  Unnamed: 4
0     2001    Anderson                    0.8078       2021-02-04         NaN
1     2001     Bedford                    0.2176       2021-02-04         NaN
2     2001      Benton                    0.1364       2021-02-04         NaN
3     2001     Bledsoe                    0.0196       2021-02-04         NaN
4     2001      Blount                    2.4310       2021-02-04         NaN
...    ...         ...                       ...              ...         ...
1809  2019     Weakley                    0.1317       2021-02-04         NaN
1810  2019       White                    0.0877       2021-02-04         NaN
1811  2019  Williamson                    3.7364       2021-02-04         NaN
1812  2019      Wilson                    1.3707       2021-02-04         NaN
1813              NaN                       NaN              NaN         NaN

[1814 rows x 5 columns]

In [6]:
employment = employment.rename(columns={"Employement In Thousands": "employment_in_thousands"})
employment

      Year      County  employment_in_thousands LastReportedDate  Unnamed: 4
0     2001    Anderson                   0.8078       2021-02-04         NaN
1     2001     Bedford                   0.2176       2021-02-04         NaN
2     2001      Benton                   0.1364       2021-02-04         NaN
3     2001     Bledsoe                   0.0196       2021-02-04         NaN
4     2001      Blount                   2.4310       2021-02-04         NaN
...    ...         ...                      ...              ...         ...
1809  2019     Weakley                   0.1317       2021-02-04         NaN
1810  2019       White                   0.0877       2021-02-04         NaN
1811  2019  Williamson                   3.7364       2021-02-04         NaN
1812  2019      Wilson                   1.3707       2021-02-04         NaN
1813              NaN                      NaN              NaN         NaN

[1814 rows x 5 columns]

In [7]:
sorted_employment = employment.sort_values(by=['employment_in_thousands'], ascending = False)
sorted_employment

,Year,County,employment_in_thousands,LastReportedDate,Unnamed: 4
1739,2019,Domestic&international,194.9919,2021-02-04,NaN
1643,2018,Domestic&international,189.7573,2021-02-04,NaN
1547,2017,Domestic&international,184.3438,2021-02-04,NaN
1451,2016,Domestic&international,178.8592,2021-02-04,NaN
1355,2015,Domestic&international,173.0747,2021-02-04,NaN
...,...,...,...,...,...
443,2005,Moore,0.0086,2021-02-04,NaN
1185,2013,Jackson,0.0085,2021-02-04,NaN
348,2004,Moore,0.0085,2021-02-04,NaN
1281,2014,Jackson,0.0083,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [8]:
expenditures = pd.read_csv('../data/expenditures.csv')
expenditures

      Year      County  Expenditure ($ Millions) LastReportedDate  Unnamed: 4
0     2001    Anderson                   66.8607       2021-02-04         NaN
1     2001     Bedford                   19.7084       2021-02-04         NaN
2     2001      Benton                   14.9474       2021-02-04         NaN
3     2001     Bledsoe                    2.6455       2021-02-04         NaN
4     2001      Blount                  173.5346       2021-02-04         NaN
...    ...         ...                       ...              ...         ...
1809  2019     Weakley                   22.3452       2021-02-04         NaN
1810  2019       White                   23.7894       2021-02-04         NaN
1811  2019  Williamson                  497.1957       2021-02-04         NaN
1812  2019      Wilson                  181.0189       2021-02-04         NaN
1813              NaN                       NaN              NaN         NaN

[1814 rows x 5 columns]

In [9]:
expenditures = expenditures.rename(columns={"Expenditure ($ Millions)": "expenditure_in_millions"})
expenditures

      Year      County  expenditure_in_millions LastReportedDate  Unnamed: 4
0     2001    Anderson                  66.8607       2021-02-04         NaN
1     2001     Bedford                  19.7084       2021-02-04         NaN
2     2001      Benton                  14.9474       2021-02-04         NaN
3     2001     Bledsoe                   2.6455       2021-02-04         NaN
4     2001      Blount                 173.5346       2021-02-04         NaN
...    ...         ...                      ...              ...         ...
1809  2019     Weakley                  22.3452       2021-02-04         NaN
1810  2019       White                  23.7894       2021-02-04         NaN
1811  2019  Williamson                 497.1957       2021-02-04         NaN
1812  2019      Wilson                 181.0189       2021-02-04         NaN
1813              NaN                      NaN              NaN         NaN

[1814 rows x 5 columns]

In [10]:
sorted_expenditures = expenditures.sort_values(by=['expenditure_in_millions'], ascending = False)
sorted_expenditures

,Year,County,expenditure_in_millions,LastReportedDate,Unnamed: 4
1739,2019,Domestic&international,23273.1505,2021-02-04,NaN
1643,2018,Domestic&international,22017.8904,2021-02-04,NaN
1547,2017,Domestic&international,20771.1007,2021-02-04,NaN
1451,2016,Domestic&international,19539.0498,2021-02-04,NaN
1355,2015,Domestic&international,18659.6526,2021-02-04,NaN
...,...,...,...,...,...
318,2004,Hancock,0.9440,2021-02-04,NaN
223,2003,Hancock,0.9003,2021-02-04,NaN
128,2002,Hancock,0.8787,2021-02-04,NaN
33,2001,Hancock,0.8768,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [11]:
local_tax_savings = pd.read_csv('../data/localtaxsavings.csv')
local_tax_savings

     Year      County     Value LastReportedDate  Unnamed: 4
0    2012    Anderson  213.5663       2021-02-04         NaN
1    2012     Bedford   86.3187       2021-02-04         NaN
2    2012      Benton  190.3855       2021-02-04         NaN
3    2012     Bledsoe   40.0661       2021-02-04         NaN
4    2012      Blount  334.2600       2021-02-04         NaN
..    ...         ...       ...              ...         ...
764  2019     Weakley   98.8182       2021-02-04         NaN
765  2019       White  143.1886       2021-02-04         NaN
766  2019  Williamson  383.4670       2021-02-04         NaN
767  2019      Wilson  218.6583       2021-02-04         NaN
768              NaN       NaN              NaN         NaN

[769 rows x 5 columns]

In [12]:
local_tax_savings = local_tax_savings.rename(columns={"Value": "tax_savings_value"})
local_tax_savings

     Year      County  tax_savings_value LastReportedDate  Unnamed: 4
0    2012    Anderson           213.5663       2021-02-04         NaN
1    2012     Bedford            86.3187       2021-02-04         NaN
2    2012      Benton           190.3855       2021-02-04         NaN
3    2012     Bledsoe            40.0661       2021-02-04         NaN
4    2012      Blount           334.2600       2021-02-04         NaN
..    ...         ...                ...              ...         ...
764  2019     Weakley            98.8182       2021-02-04         NaN
765  2019       White           143.1886       2021-02-04         NaN
766  2019  Williamson           383.4670       2021-02-04         NaN
767  2019      Wilson           218.6583       2021-02-04         NaN
768              NaN                NaN              NaN         NaN

[769 rows x 5 columns]

In [13]:
sorted_local_tax = local_tax_savings.sort_values(by=['tax_savings_value'], ascending = False)
sorted_local_tax

     Year   County  tax_savings_value LastReportedDate  Unnamed: 4
750  2019   Sevier          3993.0354       2021-02-04         NaN
654  2018   Sevier          3740.5678       2021-02-04         NaN
558  2017   Sevier          3519.1453       2021-02-04         NaN
462  2016   Sevier          3460.6472       2021-02-04         NaN
366  2015   Sevier          3137.6422       2021-02-04         NaN
..    ...      ...                ...              ...         ...
322  2015  Hancock            25.3932       2021-02-04         NaN
226  2014  Hancock            24.2480       2021-02-04         NaN
130  2013  Hancock            23.2053       2021-02-04         NaN
34   2012  Hancock            22.6914       2021-02-04         NaN
768           NaN                NaN              NaN         NaN

[769 rows x 5 columns]

In [14]:
payroll = pd.read_csv('../data/payroll.csv')
payroll

      Year      County  Payroll ($ Millions) LastReportedDate  Unnamed: 4
0     2001    Anderson               13.0858       2021-02-04         NaN
1     2001     Bedford                3.9795       2021-02-04         NaN
2     2001      Benton                2.8012       2021-02-04         NaN
3     2001     Bledsoe                0.4411       2021-02-04         NaN
4     2001      Blount               52.7141       2021-02-04         NaN
...    ...         ...                   ...              ...         ...
1809  2019     Weakley                3.5397       2021-02-04         NaN
1810  2019       White                2.8288       2021-02-04         NaN
1811  2019  Williamson               96.5744       2021-02-04         NaN
1812  2019      Wilson               36.7970       2021-02-04         NaN
1813              NaN                   NaN              NaN         NaN

[1814 rows x 5 columns]

In [15]:
payroll = payroll.rename(columns={"Payroll ($ Millions)": "payroll_in_millions"})
payroll

      Year      County  payroll_in_millions LastReportedDate  Unnamed: 4
0     2001    Anderson              13.0858       2021-02-04         NaN
1     2001     Bedford               3.9795       2021-02-04         NaN
2     2001      Benton               2.8012       2021-02-04         NaN
3     2001     Bledsoe               0.4411       2021-02-04         NaN
4     2001      Blount              52.7141       2021-02-04         NaN
...    ...         ...                  ...              ...         ...
1809  2019     Weakley               3.5397       2021-02-04         NaN
1810  2019       White               2.8288       2021-02-04         NaN
1811  2019  Williamson              96.5744       2021-02-04         NaN
1812  2019      Wilson              36.7970       2021-02-04         NaN
1813              NaN                  NaN              NaN         NaN

[1814 rows x 5 columns]

In [16]:
sorted_payroll = payroll.sort_values(by=['payroll_in_millions'], ascending = False)
sorted_payroll

,Year,County,payroll_in_millions,LastReportedDate,Unnamed: 4
1739,2019,Domestic&international,5216.3183,2021-02-04,NaN
1643,2018,Domestic&international,4996.4464,2021-02-04,NaN
1547,2017,Domestic&international,4672.3730,2021-02-04,NaN
1451,2016,Domestic&international,4356.2480,2021-02-04,NaN
1355,2015,Domestic&international,4124.8560,2021-02-04,NaN
...,...,...,...,...,...
413,2005,Hancock,0.1258,2021-02-04,NaN
223,2003,Hancock,0.1245,2021-02-04,NaN
33,2001,Hancock,0.1209,2021-02-04,NaN
128,2002,Hancock,0.1209,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [17]:
state_tax_receipts = pd.read_csv('../data/statetaxreceipts.csv')
state_tax_receipts

,Year,County,State Tax Receipts ($ Millions),LastReportedDate,Unnamed: 4
0,2001,Anderson,4.2260,2021-02-04,NaN
1,2001,Bedford,1.1942,2021-02-04,NaN
2,2001,Benton,0.9491,2021-02-04,NaN
3,2001,Bledsoe,0.1552,2021-02-04,NaN
4,2001,Blount,10.0000,2021-02-04,NaN
...,...,...,...,...,...
1809,2019,Weakley,1.3478,2021-02-04,NaN
1810,2019,White,1.4387,2021-02-04,NaN
1811,2019,Williamson,29.8548,2021-02-04,NaN
1812,2019,Wilson,10.8594,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [18]:
state_tax_receipts = state_tax_receipts.rename(columns={"State Tax Receipts ($ Millions)": "state_tax_receipts_in_millions"})
state_tax_receipts

,Year,County,state_tax_receipts_in_millions,LastReportedDate,Unnamed: 4
0,2001,Anderson,4.2260,2021-02-04,NaN
1,2001,Bedford,1.1942,2021-02-04,NaN
2,2001,Benton,0.9491,2021-02-04,NaN
3,2001,Bledsoe,0.1552,2021-02-04,NaN
4,2001,Blount,10.0000,2021-02-04,NaN
...,...,...,...,...,...
1809,2019,Weakley,1.3478,2021-02-04,NaN
1810,2019,White,1.4387,2021-02-04,NaN
1811,2019,Williamson,29.8548,2021-02-04,NaN
1812,2019,Wilson,10.8594,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [19]:
sorted_state_tax_receipts = state_tax_receipts.sort_values(by=['state_tax_receipts_in_millions'], ascending = False)
sorted_state_tax_receipts

,Year,County,state_tax_receipts_in_millions,LastReportedDate,Unnamed: 4
1739,2019,Domestic&international,1258.0108,2021-02-04,NaN
1643,2018,Domestic&international,1182.2680,2021-02-04,NaN
1547,2017,Domestic&international,1130.7871,2021-02-04,NaN
1451,2016,Domestic&international,1076.9075,2021-02-04,NaN
1355,2015,Domestic&international,1011.8209,2021-02-04,NaN
...,...,...,...,...,...
318,2004,Hancock,0.0563,2021-02-04,NaN
223,2003,Hancock,0.0548,2021-02-04,NaN
128,2002,Hancock,0.0537,2021-02-04,NaN
33,2001,Hancock,0.0532,2021-02-04,NaN
1813,,NaN,NaN,NaN,NaN

In [20]:
state_tax_savings = pd.read_csv('../data/statetaxsavings.csv')
state_tax_savings

     Year      County     Value LastReportedDate  Unnamed: 4
0    2012    Anderson   78.7385       2021-02-04         NaN
1    2012     Bedford   59.7175       2021-02-04         NaN
2    2012      Benton  344.2946       2021-02-04         NaN
3    2012     Bledsoe  114.1802       2021-02-04         NaN
4    2012      Blount  217.1596       2021-02-04         NaN
..    ...         ...       ...              ...         ...
764  2019     Weakley   54.4702       2021-02-04         NaN
765  2019       White  110.1001       2021-02-04         NaN
766  2019  Williamson  128.8763       2021-02-04         NaN
767  2019      Wilson  106.2464       2021-02-04         NaN
768              NaN       NaN              NaN         NaN

[769 rows x 5 columns]

In [21]:
state_tax_savings = state_tax_savings.rename(columns={"Value": "state_tax_value_savings"})
state_tax_savings

     Year      County  state_tax_value_savings LastReportedDate  Unnamed: 4
0    2012    Anderson                  78.7385       2021-02-04         NaN
1    2012     Bedford                  59.7175       2021-02-04         NaN
2    2012      Benton                 344.2946       2021-02-04         NaN
3    2012     Bledsoe                 114.1802       2021-02-04         NaN
4    2012      Blount                 217.1596       2021-02-04         NaN
..    ...         ...                      ...              ...         ...
764  2019     Weakley                  54.4702       2021-02-04         NaN
765  2019       White                 110.1001       2021-02-04         NaN
766  2019  Williamson                 128.8763       2021-02-04         NaN
767  2019      Wilson                 106.2464       2021-02-04         NaN
768              NaN                      NaN              NaN         NaN

[769 rows x 5 columns]

In [22]:
sorted_state_tax_savings = state_tax_savings.sort_values(by=['state_tax_value_savings'], ascending = False)
sorted_state_tax_savings

     Year    County  state_tax_value_savings LastReportedDate  Unnamed: 4
750  2019    Sevier                2022.0227       2021-02-04         NaN
654  2018    Sevier                1916.5793       2021-02-04         NaN
558  2017    Sevier                1803.7990       2021-02-04         NaN
462  2016    Sevier                1784.8474       2021-02-04         NaN
366  2015    Sevier                1637.4596       2021-02-04         NaN
..    ...       ...                      ...              ...         ...
24   2012   Fayette                  30.9140       2021-02-04         NaN
125  2013  Grainger                  30.6096       2021-02-04         NaN
120  2013   Fayette                  30.5060       2021-02-04         NaN
29   2012  Grainger                  30.1345       2021-02-04         NaN
768            NaN                      NaN              NaN         NaN

[769 rows x 5 columns]

In [23]:
total_tax_saving = pd.read_csv('../data/totaltaxsaving.csv')
total_tax_saving

     Year      County     Value LastReportedDate  Unnamed: 4
0    2012    Anderson  292.3049       2021-02-04         NaN
1    2012     Bedford  146.0362       2021-02-04         NaN
2    2012      Benton  534.6802       2021-02-04         NaN
3    2012     Bledsoe  154.2464       2021-02-04         NaN
4    2012      Blount  551.4196       2021-02-04         NaN
..    ...         ...       ...              ...         ...
764  2019     Weakley  153.2884       2021-02-04         NaN
765  2019       White  253.2887       2021-02-04         NaN
766  2019  Williamson  512.3434       2021-02-04         NaN
767  2019      Wilson  324.9047       2021-02-04         NaN
768              NaN       NaN              NaN         NaN

[769 rows x 5 columns]

In [24]:
total_tax_saving = total_tax_saving.rename(columns={"Value": "total_tax_savings"})
total_tax_saving

     Year      County  total_tax_savings LastReportedDate  Unnamed: 4
0    2012    Anderson           292.3049       2021-02-04         NaN
1    2012     Bedford           146.0362       2021-02-04         NaN
2    2012      Benton           534.6802       2021-02-04         NaN
3    2012     Bledsoe           154.2464       2021-02-04         NaN
4    2012      Blount           551.4196       2021-02-04         NaN
..    ...         ...                ...              ...         ...
764  2019     Weakley           153.2884       2021-02-04         NaN
765  2019       White           253.2887       2021-02-04         NaN
766  2019  Williamson           512.3434       2021-02-04         NaN
767  2019      Wilson           324.9047       2021-02-04         NaN
768              NaN                NaN              NaN         NaN

[769 rows x 5 columns]

In [25]:
sorted_total_tax_savings = total_tax_saving.sort_values(by=['total_tax_savings'], ascending = False)
sorted_total_tax_savings

     Year   County  total_tax_savings LastReportedDate  Unnamed: 4
750  2019   Sevier          6015.0582       2021-02-04         NaN
654  2018   Sevier          5657.1471       2021-02-04         NaN
558  2017   Sevier          5322.9443       2021-02-04         NaN
462  2016   Sevier          5245.4947       2021-02-04         NaN
366  2015   Sevier          4775.1019       2021-02-04         NaN
..    ...      ...                ...              ...         ...
312  2015  Fayette            66.6830       2021-02-04         NaN
216  2014  Fayette            64.0633       2021-02-04         NaN
24   2012  Fayette            62.8073       2021-02-04         NaN
120  2013  Fayette            61.9542       2021-02-04         NaN
768           NaN                NaN              NaN         NaN

[769 rows x 5 columns]